/*
Необхідно написати програму яка буде виводити інформацію за умовами при яких число 
виводитиметься з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ

1)Рік отримувати через prompt()
2)Зробити перевірку що користувач ввів число та це число не є від'ємним
3)Не використовувати функції або інші матеріали які ми не вивчали
*/



let age = +prompt(`Введіть рік `, `101`);

    if(age < 0)
    {
        console.log("Помилка: число від'ємне");
    }
        else if(age === 1 || age%10 == 1) //перевірка 1 і все що з 1
        {
            console.log(age + " рік");
        }
        else if((age > 1 && age <= 4) || (age%10 === 2 || age%10 === 3 || age%10 === 4)) //перевірка 2 до 4 і все що з 2,3,4
        {
            console.log(age + " роки");
        }
        else if ((age >= 5 || age <= 150) && (age%2 < 2 || age%10 >= 5)) //перевірка 5 до 150
        {
            console.log(age + " років");
        }
    else console.log("Помилка: введений тип не є числом");