/*
Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

Кілометри в метри
години в хвилини
Кілограми в грами
Зробити вивід отриманої інформації у вигляді - 10 км це 10000 м. 1 г це 60хв. 1 кг. це 1000 грм. 

1) В задачі не обов'язково використовувати prompt, просто запишіть значення в зміні
2) Обов'язково при написані завдання використовуйте switch
3) Продумати варіант якщо буде введена якась інша одиниця виміру
4) Мудрувати та створювати валідацію не потрібно
*/

//Закоментованні значення для перевірки усіх варіантів
//let a = 'liter'
//let a = 'km';
//let a = 'h';
let a = 'kg'; 
let km = 1;
let h = 1;
let kg = 1;
const minutes = h * 60;
const grams = kg * 1000;
const meters = km * 1000;

switch (a) {
    case 'km':
        console.log(km +  ` км ` + `це ` + meters + ` м.`);
        break;
    case 'h':
        console.log(h +  ` год `  + `це ` + minutes + ` хв.`);
        break;
    case 'kg':
        console.log(kg +  ` кг `  + `це ` + grams + ` грм.`);
        break;
    
    default:
        console.log('Введина величина не є зі списку доступних!');
}
