/*ДЗ 3:

Написати функцію pow(x,y) яка буде приймати 2 числа, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8. 

Умови виконання ДЗ

Не використовувати **
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_hw_loops.
Додати туди ваше домашнє завдання
Вислати вашу гілку*/

let result = 1;
function myPow(x, y) {
    for(x, y1 = 1;  y1 <= y; y1++) {
        result *= x;
        
    }
    console.log(`result = ` + result);
}
myPow(2,4)
